Revit 2024 API
SpecTypeId.PipeMassPerUnitLength Property
 Mass per Unit Length, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PipeMassPerUnitLength { get; }
Visual Basic
Public Shared ReadOnly Property PipeMassPerUnitLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PipeMassPerUnitLength {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace